12/data/attachments/f6740358d34dcdf8.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>David_industry_Friend_87411_2</nif:username>
            <nif:friendToBeRequested>soap_friends_ccb6364d-4e0a-4708-8176-7131e5e87116</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>